Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/Microchip.PIC32CX-MT_DFP.pdsc
         <device Dname="PIC32CX2051MTC128S1">
            <processor Dcore="Cortex-M4"
                       Dendian="Little-endian"
                       Dmpu="MPU"
                       Dfpu="SP_FPU"/>
            <compile header="PIC32CX-MTC/include/pic32c.h" define="__PIC32CX2051MTC128S1__"/>
            <debug svd="PIC32CX-MTC/svd/PIC32CX2051MTC128S1.svd"/>
            <memory id="IRAM1" start="0x00000000" size="0x00008000" default="1"/>
            <memory id="IRAM2" start="0x20088000" size="0x00004000"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension"
                             schemaVersion="1.0">
                  <at:atdf name="PIC32CX-MTC/atdf/PIC32CX2051MTC128S1.atdf"/>
                  <at:variant ordercode="PIC32CX2051MTC128-AU"
                              vccmin="2.25"
                              vccmax="3.6"
                              tempmin="-40"
                              tempmax="+85"/>
                  <at:memory name="PERIPHERALS"
                             start="0x40000000"
                             size="0x20000000"
                             type="io"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="IRAM1"
                             start="0x00000000"
                             size="0x00008000"
                             type="ram"
                             rw="RW"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="IRAM2"
                             start="0x20088000"
                             size="0x00004000"
                             type="ram"
                             rw="RW"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="CORTEXM_PRIVATE_PB"
                             start="0xE0000000"
                             size="0x00100000"
                             type="other"
                             rw="RW"
                             address-space="base"/>
                  <at:interface type="samjtag" name="JTAG"/>
                  <at:interface type="swd" name="SWD"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.ice4"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.nedbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.samice"/>
                  <at:tool id="com.atmel.avrdbg.tool.snap"/>
                  <at:project name="Barebone C Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.c)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone Cpp Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.cpp)"/>
                     </at:component>
                  </at:project>
                  <at:prerequisite context="compiling" Tcompiler="GCC" component="ARM-GCC"/>
                  <at:prerequisite context="compiling" Tcompiler="IAR" component="ARM-IAR"/>
                  <at:prerequisite context="compiling" Tcompiler="ARMCC" component="ARMCC"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension"
                               schemaVersion="1.0">
                  <mchp:pic name="PIC32CX-MTC/edc/PIC32CX2051MTC128S1.PIC"/>
                  <mchp:xc32 name="PIC32CX-MTC/xc32"/>
                  <mchp:hwtool type="mplab.mpheader">
                     <mchp:file name="PIC32CX-MTC/hwtools/mplab/MPHeader.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="mplab.pluginboardsupport">
                     <mchp:file name="PIC32CX-MTC/hwtools/mplab/PluginBoardSupport.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="sdm">
                     <mchp:file name="PIC32CX-MTC/hwtools/sdm/sdmCompilers.xml"/>
                     <mchp:file name="PIC32CX-MTC/hwtools/sdm/sdmDebuggerMap.xml"/>
                     <mchp:file name="PIC32CX-MTC/hwtools/sdm/sdmICD3.xml"/>
                     <mchp:file name="PIC32CX-MTC/hwtools/sdm/sdmICD4.xml"/>
                     <mchp:file name="PIC32CX-MTC/hwtools/sdm/sdmICD5.xml"/>
                     <mchp:file name="PIC32CX-MTC/hwtools/sdm/sdmICE4.xml"/>
                     <mchp:file name="PIC32CX-MTC/hwtools/sdm/sdmRealICE.xml"/>
                     <mchp:file name="PIC32CX-MTC/hwtools/sdm/sdmRealICE4.xml"/>
                     <mchp:file name="PIC32CX-MTC/hwtools/sdm/sdmSimulator.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="persfr">
                     <mchp:file name="PIC32CX-MTC/hwtools/persfr/arm32.persfr"/>
                  </mchp:hwtool>
                  <mchp:prerequisite component="MPLAB X IDE" version="[6.05-"/>
               </mchp:extension>
            </environment>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=PIC32CX2051MTC128S1"
                  title="Device page for PIC32CX2051MTC128S1"/>
            <book name="https://www.microchip.com/wwwproducts/productds/PIC32CX2051MTC128S1"
                  title="Datasheet"/>
         </device>
