Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/Microchip.PIC32CX-MT_DFP.pdsc
         <device Dname="PIC32CX2051MTSH128">
            <processor Dcore="Cortex-M4"
                       Dendian="Little-endian"
                       Dmpu="MPU"
                       Dfpu="SP_FPU"/>
            <compile header="PIC32CX-MTSH/include/pic32c.h" define="__PIC32CX2051MTSH128__"/>
            <debug svd="PIC32CX-MTSH/svd/PIC32CX2051MTSH128.svd"/>
            <memory id="IROM1"
                    start="0x01000000"
                    size="0x00100000"
                    default="1"
                    startup="1"/>
            <memory id="IROM2" start="0x01100000" size="0x00100000"/>
            <memory id="IROM3" start="0x11000000" size="0x00100000"/>
            <memory id="IROM4" start="0x11100000" size="0x00100000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00080000" default="1"/>
            <memory id="IRAM2" start="0x20080000" size="0x00008000"/>
            <memory id="IRAM3" start="0x20088000" size="0x00004000"/>
            <algorithm name="PIC32CX-MTSH/keil/flash/PIC32CXMT_2048.FLM"
                       start="0x01000000"
                       size="0x200000"
                       default="1"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension"
                             schemaVersion="1.0">
                  <at:atdf name="PIC32CX-MTSH/atdf/PIC32CX2051MTSH128.atdf"/>
                  <at:variant ordercode="PIC32CX2051MTSH128-AU"
                              vccmin="2.25"
                              vccmax="3.6"
                              tempmin="-40"
                              tempmax="+85"/>
                  <at:memory name="PERIPHERALS"
                             start="0x40000000"
                             size="0x20000000"
                             type="io"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="IFLASH0"
                             start="0x01000000"
                             size="0x00100000"
                             type="flash"
                             pagesize="512"
                             rw="RW"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="IFLASH1"
                             start="0x01100000"
                             size="0x00100000"
                             type="flash"
                             pagesize="512"
                             rw="RW"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="CPKCC_ROM"
                             start="0x02020000"
                             size="0x00010000"
                             type="other"
                             rw="R"
                             address-space="base"/>
                  <at:memory name="CPKCC_RAM"
                             start="0x02031000"
                             size="0x00001000"
                             type="other"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="QSPI_MEM"
                             start="0x04000000"
                             size="0x02000000"
                             type="other"
                             rw="RW"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="QSPI_AESB"
                             start="0x06000000"
                             size="0x02000000"
                             type="other"
                             rw="RW"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="IFLASH0_CC"
                             start="0x11000000"
                             size="0x00100000"
                             type="flash"
                             pagesize="512"
                             rw="RW"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="IFLASH1_CC"
                             start="0x11100000"
                             size="0x00100000"
                             type="flash"
                             pagesize="512"
                             rw="RW"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="QSPI_MEM_CC"
                             start="0x14000000"
                             size="0x02000000"
                             type="other"
                             rw="RW"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="QSPI_AESB_CC"
                             start="0x16000000"
                             size="0x02000000"
                             type="other"
                             rw="RW"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="DTCM"
                             start="0x1FFFA000"
                             size="0x00002000"
                             type="other"
                             rw="RW"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="ITCM"
                             start="0x1FFFC000"
                             size="0x00004000"
                             type="other"
                             rw="RW"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="IRAM0"
                             start="0x20000000"
                             size="0x00080000"
                             type="ram"
                             rw="RW"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="IRAM1"
                             start="0x20080000"
                             size="0x00008000"
                             type="ram"
                             rw="RW"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="IRAM2"
                             start="0x20088000"
                             size="0x00004000"
                             type="ram"
                             rw="RW"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="CORTEXM_PRIVATE_PB"
                             start="0xE0000000"
                             size="0x00100000"
                             type="other"
                             rw="RW"
                             address-space="base"/>
                  <at:interface type="samjtag" name="JTAG"/>
                  <at:interface type="swd" name="SWD"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.ice4"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.nedbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.samice"/>
                  <at:tool id="com.atmel.avrdbg.tool.snap"/>
                  <at:project name="Barebone C Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.c)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone Cpp Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.cpp)"/>
                     </at:component>
                  </at:project>
                  <at:prerequisite context="compiling" Tcompiler="GCC" component="ARM-GCC"/>
                  <at:prerequisite context="compiling" Tcompiler="IAR" component="ARM-IAR"/>
                  <at:prerequisite context="compiling" Tcompiler="ARMCC" component="ARMCC"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension"
                               schemaVersion="1.0">
                  <mchp:pic name="PIC32CX-MTSH/edc/PIC32CX2051MTSH128.PIC"/>
                  <mchp:xc32 name="PIC32CX-MTSH/xc32"/>
                  <mchp:hwtool type="mplab.mpheader">
                     <mchp:file name="PIC32CX-MTSH/hwtools/mplab/MPHeader.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="mplab.pluginboardsupport">
                     <mchp:file name="PIC32CX-MTSH/hwtools/mplab/PluginBoardSupport.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="sdm">
                     <mchp:file name="PIC32CX-MTSH/hwtools/sdm/sdmCompilers.xml"/>
                     <mchp:file name="PIC32CX-MTSH/hwtools/sdm/sdmDebuggerMap.xml"/>
                     <mchp:file name="PIC32CX-MTSH/hwtools/sdm/sdmICD3.xml"/>
                     <mchp:file name="PIC32CX-MTSH/hwtools/sdm/sdmICD4.xml"/>
                     <mchp:file name="PIC32CX-MTSH/hwtools/sdm/sdmICD5.xml"/>
                     <mchp:file name="PIC32CX-MTSH/hwtools/sdm/sdmICE4.xml"/>
                     <mchp:file name="PIC32CX-MTSH/hwtools/sdm/sdmRealICE.xml"/>
                     <mchp:file name="PIC32CX-MTSH/hwtools/sdm/sdmRealICE4.xml"/>
                     <mchp:file name="PIC32CX-MTSH/hwtools/sdm/sdmSimulator.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="persfr">
                     <mchp:file name="PIC32CX-MTSH/hwtools/persfr/arm32.persfr"/>
                  </mchp:hwtool>
                  <mchp:prerequisite component="MPLAB X IDE" version="[6.05-"/>
               </mchp:extension>
            </environment>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=PIC32CX2051MTSH128"
                  title="Device page for PIC32CX2051MTSH128"/>
            <book name="https://www.microchip.com/wwwproducts/productds/PIC32CX2051MTSH128"
                  title="Datasheet"/>
         </device>
