Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/Microchip.PIC32CX-MT_DFP.pdsc
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.1.0"
                 condition="PIC32CX5112MTC128S1">
         <description>Headers and startup code for Microchip PIC32CX5112MTC128S1</description>
         <files>
            <file condition="C" category="include" name="PIC32CX-MTC/include/"/>
            <file condition="C" category="header" name="PIC32CX-MTC/include/pic32c.h"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CX-MTC/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CX-MTC/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CX-MTC/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CX-MTC/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CX-MTC/gcc/gcc/startup_pic32cx5112mtc128s1.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CX-MTC/gcc/system_pic32cx5112mtc128s1.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="PIC32CX-MTC/gcc/gcc/pic32cx5112mtc128s1_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CX-MTC/armcc/armcc/startup_pic32cx5112mtc128s1.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CX-MTC/armcc/system_pic32cx5112mtc128s1.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CX-MTC/iar/iar/startup_pic32cx5112mtc128s1.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CX-MTC/iar/system_pic32cx5112mtc128s1.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="PIC32CX-MTC/iar/config/linker/Microchip/pic32cx5112mtc128s1/sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.1.0"
                 condition="PIC32CX5112MTG128">
         <description>Headers and startup code for Microchip PIC32CX5112MTG128</description>
         <files>
            <file condition="C" category="include" name="PIC32CX-MTG/include/"/>
            <file condition="C" category="header" name="PIC32CX-MTG/include/pic32c.h"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CX-MTG/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CX-MTG/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CX-MTG/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CX-MTG/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CX-MTG/gcc/gcc/startup_pic32cx5112mtg128.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CX-MTG/gcc/system_pic32cx5112mtg128.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="PIC32CX-MTG/gcc/gcc/pic32cx5112mtg128_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="PIC32CX-MTG/gcc/gcc/pic32cx5112mtg128_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CX-MTG/armcc/armcc/startup_pic32cx5112mtg128.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CX-MTG/armcc/system_pic32cx5112mtg128.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CX-MTG/iar/iar/startup_pic32cx5112mtg128.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CX-MTG/iar/system_pic32cx5112mtg128.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="PIC32CX-MTG/iar/config/linker/Microchip/pic32cx5112mtg128/sram.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="PIC32CX-MTG/iar/config/linker/Microchip/pic32cx5112mtg128/flash.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.1.0"
                 condition="PIC32CX5112MTSH128">
         <description>Headers and startup code for Microchip PIC32CX5112MTSH128</description>
         <files>
            <file condition="C" category="include" name="PIC32CX-MTSH/include/"/>
            <file condition="C"
                  category="header"
                  name="PIC32CX-MTSH/include/pic32c.h"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CX-MTSH/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CX-MTSH/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CX-MTSH/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CX-MTSH/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CX-MTSH/gcc/gcc/startup_pic32cx5112mtsh128.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CX-MTSH/gcc/system_pic32cx5112mtsh128.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="PIC32CX-MTSH/gcc/gcc/pic32cx5112mtsh128_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="PIC32CX-MTSH/gcc/gcc/pic32cx5112mtsh128_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CX-MTSH/armcc/armcc/startup_pic32cx5112mtsh128.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CX-MTSH/armcc/system_pic32cx5112mtsh128.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CX-MTSH/iar/iar/startup_pic32cx5112mtsh128.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CX-MTSH/iar/system_pic32cx5112mtsh128.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="PIC32CX-MTSH/iar/config/linker/Microchip/pic32cx5112mtsh128/sram.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="PIC32CX-MTSH/iar/config/linker/Microchip/pic32cx5112mtsh128/flash.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.1.0"
                 condition="PIC32CX5112MTSH128S1">
         <description>Headers and startup code for Microchip PIC32CX5112MTSH128S1</description>
         <files>
            <file condition="C" category="include" name="PIC32CX-MTSH/include/"/>
            <file condition="C"
                  category="header"
                  name="PIC32CX-MTSH/include/pic32c.h"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CX-MTSH/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CX-MTSH/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CX-MTSH/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CX-MTSH/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CX-MTSH/gcc/gcc/startup_pic32cx5112mtsh128s1.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CX-MTSH/gcc/system_pic32cx5112mtsh128s1.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="PIC32CX-MTSH/gcc/gcc/pic32cx5112mtsh128s1_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CX-MTSH/armcc/armcc/startup_pic32cx5112mtsh128s1.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CX-MTSH/armcc/system_pic32cx5112mtsh128s1.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CX-MTSH/iar/iar/startup_pic32cx5112mtsh128s1.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CX-MTSH/iar/system_pic32cx5112mtsh128s1.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="PIC32CX-MTSH/iar/config/linker/Microchip/pic32cx5112mtsh128s1/sram.icf"
                  attr="config"/>
         </files>
      </component>
   </components>
</package>
